Repository: scheibenkaes/DirectoryHistory
Catalog: Translation/*.po
Languages: de

source: Open directory
de: Verzeichnis angeben

source: Please decide
de: Bitte auswählen

source: ID_AskUserForCreationOfARepository
de: Das gewählte Verzeichnis ({0}) befindet sich nicht unter Versionskontrolle. Soll das gewählte Verzeichnis unter Versionskontrolle gestellt werden? (Dies ist für die Funktionalität dieses Programmes erforderlich)

source: Yes
de: Ja

source: No
de: Nein

source: Directory History
de: Verzeichnis Historie

source: A program to keep a simple history of your files.
de: Ein Programm um die Historie von Dateien zu verwalten.

source: About Directory History
de: Über Verzeichnis Historie

source: openDirectory
de: Verzeichnis öffnen

source: Opens a directory
de: Öffnet ein Verzeichnis

source: File
de: Datei

source: History
de: Historie

source: refresh
de: Neu laden

source: Refresh the current repository
de: Liesst das Verzeichnis erneut ein

source: quit
de: Beenden

source: Quit the application
de: Beendet die Anwendung

source: _About
de: _Über

source: _Add
de: Hin_zufügen

source: Add the selected file to the version control
de: Fügt die aktuell ausgewählte Datei der Versionskontrolle hinzu

source: _Apply
de: _Version erstellen

source: Save the changes to the history of this file
de: Speichert Änderungen an der gewählten Datei in der Historie

source: File_History
de: _Historie

source: Shows the history of the selected file
de: Zeigt die Versionen der gewählten Datei an

source: No directory loaded
de: Kein Verzeichnis geöffnet

source: <b>An exception occured</b>
de: <b>Ein Fehler ist aufgetreten</b>

source: label2
de: l

source: Type
de: Typ

source: Commit changes in {0}
de: Änderungen in {0} archivieren?

source: Comment:
de: Kommentar:

source: label1
de: l

source: Open this version
de: Diese Version öffnen

source: Date
de: Datum

source: Comment
de: Kommentar

source: Difference
de: Unterschied zur Vorversion

source: A comment must not be empty
de: Ein Kommentar muss Text enthalten

source: The file {0} isn't existing!
de: Die Datei {0} existiert nicht!

source: The directory under {0} is not existing
de: Das Verzeichnis unter {0} existiert nicht

source: The file or directory you tried to open does not exist! ({0})
de: Die Datei oder das Verzeichnis das versucht wurde zu öffnen exisitiert nicht ({0})
